rottenpotatoes/app/controllers/movies_controller.rb

   def find_similar_movies
    @movies = Movie.similar_movies(params[:id].to_i)
    @movie = Movie.find(params[:id])
      if @movies.nil? or @movie.director.empty?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]